---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.IDuctPressureDropServer.GetInformationLink
source: html/ebeca20a-30ac-5d42-e980-95df2c7a5d83.htm
---
# Autodesk.Revit.DB.Mechanical.IDuctPressureDropServer.GetInformationLink Method

The method that Revit will invoke to obtain a URL address which provides more information about the server.

## Syntax (C#)
```csharp
string GetInformationLink()
```

## Returns
The URL providing server information.